{"pdf_text = pdf_to_text('')": "The Indian Bureau of Mines (IBM) is the primary regulatory agency for the mining sector in India. It is responsible for granting mining leases, conducting surveys and assessments, ensuring compliance with mining laws, and promoting sustainable mining practices."}
{"Worker's Rights: What legal protections are in place for the rights of miners, including issues related to fair wages": "Miners in India are protected by laws such as the Mines Act, 1952, ensuring fair wages, decent working conditions, and health and safety measures. Legal cases have focused on workers' rights in the mining industry, such as the Singareni Collieries workers' strike in Telangana, where issues regarding wages, working conditions, and welfare amenities were central concerns."}
{"Hello say": "Indian mining law acknowledges the incorporation of new technologies in mining operations and encourages their adoption. However, there can be legal challenges related to regulatory compliance, environmental impact assessments, and community concerns. There have been cases where the use of innovative mining technologies, such as deep-sea mining or underwater mining, has prompted legal discussions and disputes regarding their potential environmental consequences."}
{"say hello": "Indian mining law acknowledges the incorporation of new technologies in mining operations and encourages their adoption. However, there can be legal challenges related to regulatory compliance, environmental impact assessments, and community concerns. There have been cases where the use of innovative mining technologies, such as deep-sea mining or underwater mining, has prompted legal discussions and disputes regarding their potential environmental consequences."}
{"Rehabilitation and Resettlement: What are the legal provisions for the rehabilitation and resettlement of communities aff": "Mining laws in India have provisions for the rehabilitation and resettlement of affected communities. These include compensation for land acquisition, alternative livelihood opportunities, housing, healthcare, and educational facilities. The mining company is responsible for implementing these provisions under the supervision of the State Government."}
{"i am injured i want to claim the compensation minig accident ": "Mining laws in India have provisions for the rehabilitation and resettlement of affected communities. These include compensation for land acquisition, alternative livelihood opportunities, housing, healthcare, and educational facilities. The mining company is responsible for implementing these provisions under the supervision of the State Government."}
{"Which is the capital of India": "The Indian Bureau of Mines (IBM) is the primary regulatory agency for the mining sector in India. It is responsible for granting mining leases, conducting surveys and assessments, ensuring compliance with mining laws, and promoting sustainable mining practices."}
{"I have been hit when I am at work": "India has various environmental regulations in place to ensure sustainable mining practices. These include conducting environmental impact assessments, obtaining clearances from the Ministry of Environment, Forest and Climate Change, and implementing measures to mitigate any adverse environmental impacts caused by mining activities."}
